

#include "mbs_drv.h"

/*
------------MODBUS_TAB----------------------------
--基本表------对象类型------访问类型----

-离散量输入-----BIT------------OR----
----线圈--------BIT------------RW----
-输入寄存器-----HALFWORD-------OR----
-保持寄存器-----HALFWORD-------RW----

---------------F01(读线圈)--------------------------------------
请求帧：设备地址(1B)+功能码(1B)+起始地址(2B)+线圈数目((N)2B)+CRC
响应帧：设备地址(1B)+功能码(1B)+字节数(N*1B)+线圈值((N%8)?(N+=1):(N))+CRC
失败响应帧：设备地址+功能码|0x80 + 异常码(01/02/03/04)+CRC 
01：功能码错误或不支持
02：寄存器地址范围无效
03：数量超限
04：读取失败

---------------F03(读多个保持寄存器)--------------------------------
请求帧：设备地址+功能码+起始地址+寄存器数目+CRC
响应帧：设备地址+功能码+字节数+寄存器值+CRC
失败响应帧：设备地址+功能码|0x80 + 异常码(01/02/03/04)+CRC 
01：功能码错误或不支持
02：寄存器地址范围无效
03：数量超限
04：读取失败

---------------F04(读输入寄存器)--------------------------------
请求帧：设备地址+功能码+起始地址+输入寄存器数目+CRC
响应帧：设备地址+功能码+字节数+输入寄存器+CRC
失败响应帧：设备地址+功能码|0x80 + 异常码(01/02/03/04)+CRC 
01：功能码错误或不支持
02：寄存器地址范围无效
03：数量超限
04：读取失败

---------------F05(写单个线圈)--------------------------------
请求帧：设备地址+功能码+起始地址+写入线圈值+CRC
响应帧：设备地址+功能码+起始地址+写入线圈值+CRC
失败响应帧：设备地址+功能码|0x80 + 异常码(01/02/03/04)+CRC 
01：功能码错误或不支持
02：寄存器地址范围无效
03：数量超限
04：读取失败

---------------F06(写单个保持寄存器)--------------------------------	
注意：接收和发送数据一致
请求帧：设备地址+功能码+起始地址+寄存器值+CRC
响应帧：设备地址+功能码+起始地址+寄存器值+CRC
失败响应帧：设备地址+功能码|0x80 + 异常码(01/02/03/04)+CRC 
01：功能码错误或不支持
02：寄存器地址范围无效
03：数量超限
04：读取失败

---------------F10(写多个寄存器)--------------------------------		
请求帧：设备地址+功能码+起始地址+寄存器数量+字节数+寄存器值+CRC
响应帧：设备地址+功能码+起始地址+寄存器数量+CRC
失败响应帧：设备地址+功能码|0x80 + 异常码(01/02/03/04)+CRC 
01：功能码错误或不支持
02：寄存器地址范围无效
03：数量超限
04：读取失败

---------------F0F(写多个线圈)--------------------------------		
请求帧：设备地址+功能码+起始地址+线圈数量+字节数+线圈值+CRC
响应帧：设备地址+功能码+起始地址+线圈数量+CRC
失败响应帧：设备地址+功能码|0x80 + 异常码(01/02/03/04)+CRC 
01：功能码错误或不支持
02：寄存器地址范围无效
03：数量超限
04：读取失败

*/

//04
unsigned char read_inputreg(void *arg,unsigned short int saddr,unsigned int reg_num)
{

}

//05 0F
unsigned char write_coil(void *arg,unsigned short int saddr,unsigned int coil_value)
{

}

//06 10
unsigned char write_holdreg(void *arg,unsigned short int saddr,unsigned char reg_num,unsigned int reg_value)
{

}
	
//03
unsigned char read_holdreg(void *arg,unsigned short int saddr,unsigned int reg_num)
{

}

//01
unsigned char read_coil(void *arg,unsigned short int saddr,unsigned int coil_num,unsigned char coil_value)
{

}


void modbus_fsm(void *arg)
{
	
}
